#                   COFFEE SHOP TRANSACTION DATASET


    My goal is to analyze the data given coming up with solutions for the given problems :
    1.Inventory Optimization
    2.Peak hours for stocking
    3.Customer retention/loyalty
    4.Revenue forecasting
    5.Pricing strategy
    6.Menu optimization

In [2]:
# MY DATA
import pandas as pd
import numpy as np
import os

url= r"C:/Users/USER/Desktop/python/projects/The Coffe Shop Project"
os.chdir(url)

Transaction= pd.read_csv("index_1.csv")
Transaction.head()

,date,datetime,cash_type,card,money,coffee_name
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.7,Latte
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.7,Hot Chocolate
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.7,Hot Chocolate
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.9,Americano
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.7,Latte

# Data Cleaning

In [3]:
Transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3636 entries, 0 to 3635
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         3636 non-null   object
 1   datetime     3636 non-null   object
 2   cash_type    3636 non-null   object
 3   card         3547 non-null   object
 4   money        3636 non-null   float64
 5   coffee_name  3636 non-null   object
dtypes: float64(1), object(5)
memory usage: 170.6+ KB

In [4]:
Transaction.describe()

             money
count  3636.000000
mean     31.746859
std       4.919926
min      18.120000
25%      27.920000
50%      32.820000
75%      35.760000
max      40.000000

In [5]:
Transaction.sum

<bound method DataFrame.sum of             date                 datetime cash_type                 card  \
0     2024-03-01  2024-03-01 10:15:50.520      card  ANON-0000-0000-0001
1     2024-03-01  2024-03-01 12:19:22.539      card  ANON-0000-0000-0002
2     2024-03-01  2024-03-01 12:20:18.089      card  ANON-0000-0000-0002
3     2024-03-01  2024-03-01 13:46:33.006      card  ANON-0000-0000-0003
4     2024-03-01  2024-03-01 13:48:14.626      card  ANON-0000-0000-0004
...          ...                      ...       ...                  ...
3631  2025-03-23  2025-03-23 10:34:54.894      card  ANON-0000-0000-1158
3632  2025-03-23  2025-03-23 14:43:37.362      card  ANON-0000-0000-1315
3633  2025-03-23  2025-03-23 14:44:16.864      card  ANON-0000-0000-1315
3634  2025-03-23  2025-03-23 15:47:28.723      card  ANON-0000-0000-1316
3635  2025-03-23  2025-03-23 18:11:38.635      card  ANON-0000-0000-1275

      money    coffee_name
0     38.70          Latte
1     38.70  Hot Chocolate
2     38.70  Hot Chocolate
3     28.90      Americano
4     38.70          Latte
...     ...            ...
3631  35.76     Cappuccino
3632  35.76          Cocoa
3633  35.76          Cocoa
3634  25.96      Americano
3635  35.76          Latte

[3636 rows x 6 columns]>

In [6]:
Transaction.columns

Index(['date', 'datetime', 'cash_type', 'card', 'money', 'coffee_name'], dtype='object')

In [7]:
Transaction.isna().sum()

date            0
datetime        0
cash_type       0
card           89
money           0
coffee_name     0
dtype: int64

In [8]:
Transaction

,date,datetime,cash_type,card,money,coffee_name
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.70,Latte
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.70,Hot Chocolate
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.70,Hot Chocolate
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.90,Americano
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.70,Latte
...,...,...,...,...,...,...
3631,2025-03-23,2025-03-23 10:34:54.894,card,ANON-0000-0000-1158,35.76,Cappuccino
3632,2025-03-23,2025-03-23 14:43:37.362,card,ANON-0000-0000-1315,35.76,Cocoa
3633,2025-03-23,2025-03-23 14:44:16.864,card,ANON-0000-0000-1315,35.76,Cocoa
3634,2025-03-23,2025-03-23 15:47:28.723,card,ANON-0000-0000-1316,25.96,Americano
3635,2025-03-23,2025-03-23 18:11:38.635,card,ANON-0000-0000-1275,35.76,Latte

In [9]:
# Using content knowledge, i need to fill in or do away with the columns that have alot of null values, henceforth making it valuable or not

Transaction.isna().sum()/Transaction.isnull().count().sort_values() * 100

date           0.000000
datetime       0.000000
cash_type      0.000000
card           2.447745
money          0.000000
coffee_name    0.000000
dtype: float64

In [10]:
new_data= Transaction.drop(columns=['card'])
new_data
# The card type someone uses has no value or rather will not help in coming up with solutions for the above the problem s i need to solve.
# therefore i drop the comulmn

            date                 datetime cash_type  money    coffee_name
0     2024-03-01  2024-03-01 10:15:50.520      card  38.70          Latte
1     2024-03-01  2024-03-01 12:19:22.539      card  38.70  Hot Chocolate
2     2024-03-01  2024-03-01 12:20:18.089      card  38.70  Hot Chocolate
3     2024-03-01  2024-03-01 13:46:33.006      card  28.90      Americano
4     2024-03-01  2024-03-01 13:48:14.626      card  38.70          Latte
...          ...                      ...       ...    ...            ...
3631  2025-03-23  2025-03-23 10:34:54.894      card  35.76     Cappuccino
3632  2025-03-23  2025-03-23 14:43:37.362      card  35.76          Cocoa
3633  2025-03-23  2025-03-23 14:44:16.864      card  35.76          Cocoa
3634  2025-03-23  2025-03-23 15:47:28.723      card  25.96      Americano
3635  2025-03-23  2025-03-23 18:11:38.635      card  35.76          Latte

[3636 rows x 5 columns]

In [11]:
new_data['datetime'].str.split(' ', expand= True)

               0             1
0     2024-03-01  10:15:50.520
1     2024-03-01  12:19:22.539
2     2024-03-01  12:20:18.089
3     2024-03-01  13:46:33.006
4     2024-03-01  13:48:14.626
...          ...           ...
3631  2025-03-23  10:34:54.894
3632  2025-03-23  14:43:37.362
3633  2025-03-23  14:44:16.864
3634  2025-03-23  15:47:28.723
3635  2025-03-23  18:11:38.635

[3636 rows x 2 columns]

In [12]:
new_data[["date2","Time"]]=new_data['datetime'].str.split(' ', expand= True)
# I am splitting the datetime column so that it becomes clear with only time!

In [13]:
new_data.drop(columns=["datetime","date2"],inplace=True)
new_data

            date cash_type  money    coffee_name          Time
0     2024-03-01      card  38.70          Latte  10:15:50.520
1     2024-03-01      card  38.70  Hot Chocolate  12:19:22.539
2     2024-03-01      card  38.70  Hot Chocolate  12:20:18.089
3     2024-03-01      card  28.90      Americano  13:46:33.006
4     2024-03-01      card  38.70          Latte  13:48:14.626
...          ...       ...    ...            ...           ...
3631  2025-03-23      card  35.76     Cappuccino  10:34:54.894
3632  2025-03-23      card  35.76          Cocoa  14:43:37.362
3633  2025-03-23      card  35.76          Cocoa  14:44:16.864
3634  2025-03-23      card  25.96      Americano  15:47:28.723
3635  2025-03-23      card  35.76          Latte  18:11:38.635

[3636 rows x 5 columns]

# Data Analysis: Inventory Optimization

HINT: Popularity of a coffee type to avoid overstocking or understocking

In [14]:
#Starting with the first problem: Inventory optimization, i need to check out which coffe type are most popular so that the coffe shop will know which cofffe type should be most at stock and which one to understock
new_data['coffee_name'].value_counts()

coffee_name
Americano with Milk    824
Latte                  782
Americano              578
Cappuccino             501
Cortado                292
Hot Chocolate          282
Cocoa                  243
Espresso               134
Name: count, dtype: int64

In [15]:
#Before making a rushed decision of understocking expresso , i need to know the exact time of the day and  which day of the week a certain kind is most preferred
coffee= new_data.set_index('coffee_name')
coffee

                     date cash_type  money          Time
coffee_name
Latte          2024-03-01      card  38.70  10:15:50.520
Hot Chocolate  2024-03-01      card  38.70  12:19:22.539
Hot Chocolate  2024-03-01      card  38.70  12:20:18.089
Americano      2024-03-01      card  28.90  13:46:33.006
Latte          2024-03-01      card  38.70  13:48:14.626
...                   ...       ...    ...           ...
Cappuccino     2025-03-23      card  35.76  10:34:54.894
Cocoa          2025-03-23      card  35.76  14:43:37.362
Cocoa          2025-03-23      card  35.76  14:44:16.864
Americano      2025-03-23      card  25.96  15:47:28.723
Latte          2025-03-23      card  35.76  18:11:38.635

[3636 rows x 4 columns]

In [16]:
coffee.loc['Americano with Milk'].head(10)

                           date cash_type  money          Time
coffee_name
Americano with Milk  2024-03-01      card   33.8  15:39:47.726
Americano with Milk  2024-03-01      card   33.8  18:39:03.580
Americano with Milk  2024-03-01      card   33.8  19:23:15.887
Americano with Milk  2024-03-01      card   33.8  19:29:17.391
Americano with Milk  2024-03-02      card   33.8  10:41:41.249
Americano with Milk  2024-03-02      card   33.8  11:59:45.484
Americano with Milk  2024-03-02      card   33.8  16:37:24.475
Americano with Milk  2024-03-03      card   33.8  18:03:23.369
Americano with Milk  2024-03-03      card   33.8  18:04:27.946
Americano with Milk  2024-03-04      card   33.8  11:05:16.184

In [17]:
new_data['money'].value_counts()
#i want to know the preferrable price and what exactly is the coffe type
# most people go for the $35.76

money
35.76    1014
32.82     490
25.96     459
30.86     389
27.92     334
37.72     273
23.02     208
38.70     128
28.90      93
21.06      59
33.80      51
18.12      36
40.00      32
39.00      18
24.00      14
30.00      11
29.00       8
35.00       8
34.00       7
25.00       4
Name: count, dtype: int64

In [18]:
price= new_data.set_index('money')
price

             date cash_type    coffee_name          Time
money
38.70  2024-03-01      card          Latte  10:15:50.520
38.70  2024-03-01      card  Hot Chocolate  12:19:22.539
38.70  2024-03-01      card  Hot Chocolate  12:20:18.089
28.90  2024-03-01      card      Americano  13:46:33.006
38.70  2024-03-01      card          Latte  13:48:14.626
...           ...       ...            ...           ...
35.76  2025-03-23      card     Cappuccino  10:34:54.894
35.76  2025-03-23      card          Cocoa  14:43:37.362
35.76  2025-03-23      card          Cocoa  14:44:16.864
25.96  2025-03-23      card      Americano  15:47:28.723
35.76  2025-03-23      card          Latte  18:11:38.635

[3636 rows x 4 columns]

In [19]:
k=price.loc[35.76]
k

             date cash_type coffee_name          Time
money
35.76  2024-09-28      card       Latte  14:25:47.337
35.76  2024-09-28      card       Latte  16:57:20.118
35.76  2024-09-28      card       Latte  20:34:31.110
35.76  2024-09-28      card       Latte  20:38:36.502
35.76  2024-09-28      card  Cappuccino  22:16:36.777
...           ...       ...         ...           ...
35.76  2025-03-23      card       Latte  10:07:11.278
35.76  2025-03-23      card  Cappuccino  10:34:54.894
35.76  2025-03-23      card       Cocoa  14:43:37.362
35.76  2025-03-23      card       Cocoa  14:44:16.864
35.76  2025-03-23      card       Latte  18:11:38.635

[1014 rows x 4 columns]

In [20]:
k['coffee_name'].value_counts()
# Judging from the analysis, this group of buyers are important....the given type of coffee should definatley be kept at stock!!

coffee_name
Latte            397
Cappuccino       235
Hot Chocolate    193
Cocoa            189
Name: count, dtype: int64

In [21]:
new_data['coffee_name'].value_counts()

coffee_name
Americano with Milk    824
Latte                  782
Americano              578
Cappuccino             501
Cortado                292
Hot Chocolate          282
Cocoa                  243
Espresso               134
Name: count, dtype: int64

In [22]:
second_price= price.loc[32.82]
second_price

             date cash_type          coffee_name          Time
money
32.82  2024-04-20      card  Americano with Milk  15:22:40.717
32.82  2024-04-20      card  Americano with Milk  15:49:25.148
32.82  2024-04-22      card  Americano with Milk  11:29:27.099
32.82  2024-04-23      card  Americano with Milk  14:23:53.144
32.82  2024-04-23      card  Americano with Milk  19:42:27.765
...           ...       ...                  ...           ...
32.82  2024-09-27      card                Latte  18:08:58.239
32.82  2024-09-27      card           Cappuccino  18:37:45.891
32.82  2024-09-27      card           Cappuccino  18:40:53.757
32.82  2024-09-27      card           Cappuccino  20:18:13.287
32.82  2024-09-27      card           Cappuccino  20:19:14.319

[490 rows x 4 columns]

In [23]:
second_price['coffee_name'].value_counts()

coffee_name
Latte                  194
Americano with Milk    147
Cappuccino              96
Cocoa                   27
Hot Chocolate           26
Name: count, dtype: int64

In [24]:
third_price= price.loc[25.96]
third_price

             date cash_type coffee_name          Time
money
25.96  2024-09-28      card     Cortado  22:18:16.072
25.96  2024-09-29      card   Americano  10:48:45.050
25.96  2024-09-29      card     Cortado  12:50:58.444
25.96  2024-09-30      card     Cortado  08:08:47.516
25.96  2024-09-30      card     Cortado  08:58:54.669
...           ...       ...         ...           ...
25.96  2025-03-21      card   Americano  15:24:42.515
25.96  2025-03-21      card   Americano  18:59:24.271
25.96  2025-03-22      card   Americano  12:25:59.676
25.96  2025-03-22      card   Americano  13:06:21.590
25.96  2025-03-23      card   Americano  15:47:28.723

[459 rows x 4 columns]

In [25]:
third_price['coffee_name'].value_counts()

coffee_name
Americano    341
Cortado      118
Name: count, dtype: int64

In [26]:
fourth_price= price.loc[30.86]
fourth_price

             date cash_type          coffee_name          Time
money
30.86  2024-09-28      card  Americano with Milk  17:26:16.704
30.86  2024-09-29      card  Americano with Milk  10:53:42.331
30.86  2024-09-30      card  Americano with Milk  10:01:09.168
30.86  2024-09-30      card  Americano with Milk  11:32:54.558
30.86  2024-09-30      card  Americano with Milk  16:45:44.460
...           ...       ...                  ...           ...
30.86  2025-03-22      card  Americano with Milk  10:30:09.403
30.86  2025-03-22      card  Americano with Milk  12:18:27.491
30.86  2025-03-22      card  Americano with Milk  13:23:17.918
30.86  2025-03-22      card  Americano with Milk  17:53:35.942
30.86  2025-03-22      card  Americano with Milk  19:16:52.727

[389 rows x 4 columns]

In [27]:
fourth_price['coffee_name'].value_counts()

coffee_name
Americano with Milk    389
Name: count, dtype: int64

In [28]:
new_data['coffee_name'].value_counts()

coffee_name
Americano with Milk    824
Latte                  782
Americano              578
Cappuccino             501
Cortado                292
Hot Chocolate          282
Cocoa                  243
Espresso               134
Name: count, dtype: int64

# Therefore the most crucial coffee types that should definately be at full stock are:
    Americano with milk
    Latte
    Americano
    Cappuccino
    Hot chocolate
    Cocoa
    Cortado

# Data analysis: Peak hours for stocking
Since we can't do away with expresso simply because some people actually buy it, we need to look at specific days the different coffee types are preffered and when exactly should a certain stock be at full

In [29]:
new_data

            date cash_type  money    coffee_name          Time
0     2024-03-01      card  38.70          Latte  10:15:50.520
1     2024-03-01      card  38.70  Hot Chocolate  12:19:22.539
2     2024-03-01      card  38.70  Hot Chocolate  12:20:18.089
3     2024-03-01      card  28.90      Americano  13:46:33.006
4     2024-03-01      card  38.70          Latte  13:48:14.626
...          ...       ...    ...            ...           ...
3631  2025-03-23      card  35.76     Cappuccino  10:34:54.894
3632  2025-03-23      card  35.76          Cocoa  14:43:37.362
3633  2025-03-23      card  35.76          Cocoa  14:44:16.864
3634  2025-03-23      card  25.96      Americano  15:47:28.723
3635  2025-03-23      card  35.76          Latte  18:11:38.635

[3636 rows x 5 columns]

In [30]:
# I want to look specifically at the yea 2024 therefor i'll filter the data
new_data['date'].str.contains('2024')

0        True
1        True
2        True
3        True
4        True
        ...
3631    False
3632    False
3633    False
3634    False
3635    False
Name: date, Length: 3636, dtype: bool

In [31]:
# I'M AFRAID TO UNLEASH THIS, I'LL HAVE TO PLOT A GRAPH, WHICH I SHALL ELUCIDATE FURTHER IN VISUALISATION

# Loyalty/ Customer retention

In [32]:
Transaction.sample()

,date,datetime,cash_type,card,money,coffee_name
3595,2025-03-20,2025-03-20 19:36:41.600,card,ANON-0000-0000-1310,35.76,Cocoa

In [33]:
Transaction['card'].value_counts()
# Dropping the card column wasn't a good idea since it tells us how often the person buys and this is quite significant in knowing if the marketing is working.

card
ANON-0000-0000-0012    129
ANON-0000-0000-0141    108
ANON-0000-0000-1163     77
ANON-0000-0000-0276     69
ANON-0000-0000-0009     67
                      ...
ANON-0000-0000-0561      1
ANON-0000-0000-0562      1
ANON-0000-0000-0563      1
ANON-0000-0000-0564      1
ANON-0000-0000-1316      1
Name: count, Length: 1316, dtype: int64

In [34]:
second_data= Transaction

In [35]:
# i'll do a mini- cleaning here
second_data[["date2","Time"]]=second_data['datetime'].str.split(' ', expand= True)
second_data
# I am splitting the datetime column so that it becomes clear with only time!

,date,datetime,cash_type,card,money,coffee_name,date2,Time
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.70,Latte,2024-03-01,10:15:50.520
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.70,Hot Chocolate,2024-03-01,12:19:22.539
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.70,Hot Chocolate,2024-03-01,12:20:18.089
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.90,Americano,2024-03-01,13:46:33.006
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.70,Latte,2024-03-01,13:48:14.626
...,...,...,...,...,...,...,...,...
3631,2025-03-23,2025-03-23 10:34:54.894,card,ANON-0000-0000-1158,35.76,Cappuccino,2025-03-23,10:34:54.894
3632,2025-03-23,2025-03-23 14:43:37.362,card,ANON-0000-0000-1315,35.76,Cocoa,2025-03-23,14:43:37.362
3633,2025-03-23,2025-03-23 14:44:16.864,card,ANON-0000-0000-1315,35.76,Cocoa,2025-03-23,14:44:16.864
3634,2025-03-23,2025-03-23 15:47:28.723,card,ANON-0000-0000-1316,25.96,Americano,2025-03-23,15:47:28.723
3635,2025-03-23,2025-03-23 18:11:38.635,card,ANON-0000-0000-1275,35.76,Latte,2025-03-23,18:11:38.635

In [36]:
second_data.drop(columns=['datetime','date2'])

,date,cash_type,card,money,coffee_name,Time
0,2024-03-01,card,ANON-0000-0000-0001,38.70,Latte,10:15:50.520
1,2024-03-01,card,ANON-0000-0000-0002,38.70,Hot Chocolate,12:19:22.539
2,2024-03-01,card,ANON-0000-0000-0002,38.70,Hot Chocolate,12:20:18.089
3,2024-03-01,card,ANON-0000-0000-0003,28.90,Americano,13:46:33.006
4,2024-03-01,card,ANON-0000-0000-0004,38.70,Latte,13:48:14.626
...,...,...,...,...,...,...
3631,2025-03-23,card,ANON-0000-0000-1158,35.76,Cappuccino,10:34:54.894
3632,2025-03-23,card,ANON-0000-0000-1315,35.76,Cocoa,14:43:37.362
3633,2025-03-23,card,ANON-0000-0000-1315,35.76,Cocoa,14:44:16.864
3634,2025-03-23,card,ANON-0000-0000-1316,25.96,Americano,15:47:28.723
3635,2025-03-23,card,ANON-0000-0000-1275,35.76,Latte,18:11:38.635

In [37]:
second_data['card'].value_counts()
# there are customers who often buy from the shop thus marketing definately is working

card
ANON-0000-0000-0012    129
ANON-0000-0000-0141    108
ANON-0000-0000-1163     77
ANON-0000-0000-0276     69
ANON-0000-0000-0009     67
                      ...
ANON-0000-0000-0561      1
ANON-0000-0000-0562      1
ANON-0000-0000-0563      1
ANON-0000-0000-0564      1
ANON-0000-0000-1316      1
Name: count, Length: 1316, dtype: int64

# VISUALIZATION

In [38]:
new_data

            date cash_type  money    coffee_name          Time
0     2024-03-01      card  38.70          Latte  10:15:50.520
1     2024-03-01      card  38.70  Hot Chocolate  12:19:22.539
2     2024-03-01      card  38.70  Hot Chocolate  12:20:18.089
3     2024-03-01      card  28.90      Americano  13:46:33.006
4     2024-03-01      card  38.70          Latte  13:48:14.626
...          ...       ...    ...            ...           ...
3631  2025-03-23      card  35.76     Cappuccino  10:34:54.894
3632  2025-03-23      card  35.76          Cocoa  14:43:37.362
3633  2025-03-23      card  35.76          Cocoa  14:44:16.864
3634  2025-03-23      card  25.96      Americano  15:47:28.723
3635  2025-03-23      card  35.76          Latte  18:11:38.635

[3636 rows x 5 columns]

In [39]:
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns